/*
correct.h
*/

#ifndef _INCLUDE_CORRECT_FUNC_
#define _INCLUDE_CORRECT_FUNC_

/*エラーコード*/
#define E_CODE_2101 2101    //入力値不正エラー（入力された開始年月日が不正）
#define E_CODE_2102 2102    //入力値不正エラー（入力された終了年月日が不正）
#define E_CODE_2103 2103    //入力値不正エラー（入力された開始年月日が終了年月日よりも大きい値）
#define E_CODE_2104 2104    //入力値不正エラー（入力された開始時間が不正）
#define E_CODE_2105 2105    //入力値不正エラー（入力された開始時間が指定可能時間を超えている）
#define E_CODE_2106 2106    //入力値不正エラー（入力された終了時間が不正）
#define E_CODE_2107 2107    //入力値不正エラー（入力された終了時間が指定可能時間を超えている）
#define E_CODE_2108 2108    //入力値不正エラー（入力された開始時間が終了時間よりも大きい値）
#define E_CODE_2109 2109    //入力値不正エラー（入力された地域番号が存在しない）
#define E_CODE_2110 2110    //入力値不正エラー（入力されたチェーン番号が存在しない）
#define E_CODE_2111 2111    //入力値不正エラー（入力された店舗番号が存在しない）
#define E_CODE_2112 2112    //入力値不正エラー（入力された商品番号が存在しない）

#define E_CODE_2113 2113    //データベースエラー（データベースに絞り込まれた内容のデータが存在しない）


#endif